Model: "SFModel1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Hidden1 (Dense)              (None, 21)                462       
_________________________________________________________________
Hidden2 (Dense)              (None, 16)                352       
_________________________________________________________________
Hidden3 (Dense)              (None, 16)                272       
_________________________________________________________________
Hidden4 (Dense)              (None, 8)                 136       
_________________________________________________________________
Hidden5 (Dense)              (None, 8)                 72        
_________________________________________________________________
Hidden6 (Dense)              (None, 4)                 36        
_________________________________________________________________
Hidden7 (Dense)              (None, 4)                 20        
_________________________________________________________________
Output (Dense)               (None, 1)                 5         
=================================================================
Total params: 1,355
Trainable params: 1,355
Non-trainable params: 0
_________________________________________________________________

SFModel1 Evaluation on test data
3799/3799 [==============================] - 0s 44us/sample - loss: 0.0511 - 
root_mean_squared_error: 0.1463 - mean_absolute_error: 0.1051