Model: "AugmModel1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Hidden1 (Dense)              (None, 32)                2048      
_________________________________________________________________
Hidden2 (Dense)              (None, 16)                528       
_________________________________________________________________
Hidden3 (Dense)              (None, 16)                272       
_________________________________________________________________
Hidden4 (Dense)              (None, 8)                 136       
_________________________________________________________________
Hidden5 (Dense)              (None, 8)                 72        
_________________________________________________________________
Hidden6 (Dense)              (None, 4)                 36        
_________________________________________________________________
Hidden7 (Dense)              (None, 4)                 20        
_________________________________________________________________
Output (Dense)               (None, 1)                 5         
=================================================================
Total params: 3,117
Trainable params: 3,117
Non-trainable params: 0
_________________________________________________________________

AugmModel1 Evaluated on test data
3797/3797 [==============================] - 0s 17us/sample - loss: 0.0382 - 
root_mean_squared_error: 0.1214 - mean_absolute_error: 0.0882